tutorials/multiphase/interFoam/RAS/damBreakPorousBaffle/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication blockMesh
runApplication setFields

runApplication createBaffles -overwrite

runApplication $(getApplication)

#------------------------------------------------------------------------------
